CSI API ETABS v1
cAreaObj.GetRebarDataPier Method
 Retrieves rebar data for an area pier object
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetRebarDataPier(
	string Name,
	ref int NumberRebarLayers,
	ref string[] LayerID,
	ref eWallPierRebarLayerType[] LayerType,
	ref double[] ClearCover,
	ref string[] BarSizeName,
	ref double[] BarArea,
	ref double[] BarSpacing,
	ref int[] NumberBars,
	ref bool[] Confined,
	ref double[] EndZoneLength,
	ref double[] EndZoneThickness,
	ref double[] EndZoneOffset
)
Function GetRebarDataPier (
	Name As String,
	ByRef NumberRebarLayers As Integer,
	ByRef LayerID As String(),
	ByRef LayerType As eWallPierRebarLayerType(),
	ByRef ClearCover As Double(),
	ByRef BarSizeName As String(),
	ByRef BarArea As Double(),
	ByRef BarSpacing As Double(),
	ByRef NumberBars As Integer(),
	ByRef Confined As Boolean(),
	ByRef EndZoneLength As Double(),
	ByRef EndZoneThickness As Double(),
	ByRef EndZoneOffset As Double()
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim NumberRebarLayers As Integer
Dim LayerID As String()
Dim LayerType As eWallPierRebarLayerType()
Dim ClearCover As Double()
Dim BarSizeName As String()
Dim BarArea As Double()
Dim BarSpacing As Double()
Dim NumberBars As Integer()
Dim Confined As Boolean()
Dim EndZoneLength As Double()
Dim EndZoneThickness As Double()
Dim EndZoneOffset As Double()
Dim returnValue As Integer
returnValue = instance.GetRebarDataPier(Name,
	NumberRebarLayers, LayerID, LayerType,
	ClearCover, BarSizeName, BarArea,
	BarSpacing, NumberBars, Confined,
	EndZoneLength, EndZoneThickness,
	EndZoneOffset)
int GetRebarDataPier(
	String^ Name,
	int% NumberRebarLayers,
	array<String^>^% LayerID,
	array<eWallPierRebarLayerType>^% LayerType,
	array<double>^% ClearCover,
	array<String^>^% BarSizeName,
	array<double>^% BarArea,
	array<double>^% BarSpacing,
	array<int>^% NumberBars,
	array<bool>^% Confined,
	array<double>^% EndZoneLength,
	array<double>^% EndZoneThickness,
	array<double>^% EndZoneOffset
)
abstract GetRebarDataPier :
        Name : string *
        NumberRebarLayers : int byref *
        LayerID : string[] byref *
        LayerType : eWallPierRebarLayerType[] byref *
        ClearCover : float[] byref *
        BarSizeName : string[] byref *
        BarArea : float[] byref *
        BarSpacing : float[] byref *
        NumberBars : int[] byref *
        Confined : bool[] byref *
        EndZoneLength : float[] byref *
        EndZoneThickness : float[] byref *
        EndZoneOffset : float[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing area object
NumberRebarLayers
Type: System.Int32
LayerID
Type: System.String[]
LayerType
Type: ETABSv1.eWallPierRebarLayerType[]
ClearCover
Type: System.Double[]
BarSizeName
Type: System.String[]
BarArea
Type: System.Double[]
BarSpacing
Type: System.Double[]
NumberBars
Type: System.Int32[]
Confined
Type: System.Boolean[]
EndZoneLength
Type: System.Double[]
EndZoneThickness
Type: System.Double[]
EndZoneOffset
Type: System.Double[]
Return Value
Type: Int32
Remarks
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace